clear all
clc
%单纯形算法
 A=[0 5 1 0 0; 6 2 0 1 0; 1 1 0 0 1];
 b=[15; 24;5];
 c=[-2;-1;0;0;0];
v=[3;4;5];
 [ X, v ] = simplex( A, b, c,v )
 
 %修正单纯形算法
 
  A=[0 5 1 0 0; 6 2 0 1 0; 1 1 0 0 1];
 b=[15; 24;5];
 c=[-2;-1;0;0;0];
v=[3;4;5];
Binv=eye(3);
[x,v,Binv]=revsimp(A,b,c,v,Binv)
  

 %两阶段单纯形算法
 A=[0 5 1 0 0; 6 2 0 1 0; 1 1 0 0 1];
 b=[15; 24;5];
 c=[-2;-1;0;0;0];
 [ x,v ] = twophase( A, b, c )
 
%
A = [1 0 1 0 0; 0 1 0 1 0; 1 1 0 0 1];
% A为约束方程组系数矩阵
b = [4;6;8];
%b为约束方程组常数项
c = [-2;-5;0;0;0];
u = [2;3;2;3;3];
[x,N] = affscale(A,b,c,u)